Revit 2027 API
ValueAtPointFlags Enumeration
 Enumerated type containing flags related to the display on particular points. Enumerated type that stores bit values of flags that can be set at any domain point.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ValueAtPointFlags
Public Enumeration ValueAtPointFlags
public enum class ValueAtPointFlags
type ValueAtPointFlags
Members
Member name | Value | Description
DisplayFence | 2 |  Show fence for the point if allowed by display style (applies only to diagram display style)
DisplayText | 1 |  Show text marker for the point if allowed by display style (applies only to certain display styles)
None | 0 |  No flags set
See Also
Reference
Autodesk.Revit.DB Namespace